Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::OpeningExtrusionParameters Class Reference
Element Manager
#include <OpeningExtrusionParameters.hpp>
 Inheritance diagram for ACAPI::Element::OpeningExtrusionParameters:
 Public Member Functions
ShapeType  | GetShapeType () const
std::optional< double >  | GetWidth () const
std::optional< double >  | GetHeight () const
std::optional< LinkedStatus >  | GetLinkedStatus () const
Constraint  | GetConstraint () const
API_AnchorID  | GetAnchor () const
std::optional< double >  | GetAnchorAltitude () const
LimitType  | GetLimitType () const
std::optional< double >  | GetExtrusionStartOffset () const
std::optional< double >  | GetFiniteBodyLength () const
bool  | IsEndSurfaceAttributeOverridden () const
API_AttributeIndex  | GetOverriddenEndSurfaceAttributeIndex () const
bool  | IsExtrusionSurfaceAttributeOverridden () const
API_AttributeIndex  | GetOverriddenExtrusionSurfaceAttributeIndex () const
bool  | AreOverriddenSurfaceAttributesLinked () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
OpeningExtrusionParameters (std::shared_ptr< Impl::OpeningExtrusionParametersBase > impl)
Constructs an OpeningExtrusionParameters with an OpeningExtrusionParameters implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 class  | OpeningDefault
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the parameters of the extrusion body of an Opening element or an OpeningDefault element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ OpeningExtrusionParameters()
 ACAPI::Element::OpeningExtrusionParameters::OpeningExtrusionParameters  |  ( |  std::shared_ptr< Impl::OpeningExtrusionParametersBase > |  impl | )
protected
Constructs an OpeningExtrusionParameters with an OpeningExtrusionParameters implementation.
Parameters
impl | The OpeningExtrusionParameters implementation.
Member Function Documentation
◆ AreOverriddenSurfaceAttributesLinked()
 bool ACAPI::Element::OpeningExtrusionParameters::AreOverriddenSurfaceAttributesLinked  |  ( |   | ) |   const
Returns
Returns whether the overridden end surface and extrusion surface attributes are linked together.
◆ GetAnchor()
 API_AnchorID ACAPI::Element::OpeningExtrusionParameters::GetAnchor  |  ( |   | ) |   const
Returns
Returns the anchor point of the opening.
◆ GetAnchorAltitude()
 std::optional< double > ACAPI::Element::OpeningExtrusionParameters::GetAnchorAltitude  |  ( |   | ) |   const
Returns
Returns the altitude of the anchor point of the opening or std::nullopt if Constrain is not ForcedHorizontal and not Aligned.
◆ GetConstraint()
 Constraint ACAPI::Element::OpeningExtrusionParameters::GetConstraint  |  ( |   | ) |   const
Returns
Returns the orientation of extrusion body in the host element.
◆ GetExtrusionStartOffset()
 std::optional< double > ACAPI::Element::OpeningExtrusionParameters::GetExtrusionStartOffset  |  ( |   | ) |   const
Returns
Returns the extrusion offset from the reference plane if the extrusion body is not Infinite.
◆ GetFiniteBodyLength()
 std::optional< double > ACAPI::Element::OpeningExtrusionParameters::GetFiniteBodyLength  |  ( |   | ) |   const
Returns
Returns the length of the extrusion body if it is limited on both sides
◆ GetHeight()
 std::optional< double > ACAPI::Element::OpeningExtrusionParameters::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the opening, or std::nullopt if the polygon type is not Rectangular or Circular.
◆ GetLimitType()
 LimitType ACAPI::Element::OpeningExtrusionParameters::GetLimitType  |  ( |   | ) |   const
Returns
Returns the limit type of the extrusion body.
◆ GetLinkedStatus()
 std::optional< LinkedStatus > ACAPI::Element::OpeningExtrusionParameters::GetLinkedStatus  |  ( |   | ) |   const
Returns
Returns if the width and height value are related.
◆ GetOverriddenEndSurfaceAttributeIndex()
 API_AttributeIndex ACAPI::Element::OpeningExtrusionParameters::GetOverriddenEndSurfaceAttributeIndex  |  ( |   | ) |   const
Returns
Returns the overridden AttributeIndex of the Surface attribute of the end Surface.
◆ GetOverriddenExtrusionSurfaceAttributeIndex()
 API_AttributeIndex ACAPI::Element::OpeningExtrusionParameters::GetOverriddenExtrusionSurfaceAttributeIndex  |  ( |   | ) |   const
Returns
Returns the overridden AttributeIndex of the Surface attribute of the Extrusion Surface.
◆ GetShapeType()
 ShapeType ACAPI::Element::OpeningExtrusionParameters::GetShapeType  |  ( |   | ) |   const
Returns
Returns the type of the base polygon
◆ GetWidth()
 std::optional< double > ACAPI::Element::OpeningExtrusionParameters::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the opening, or std::nullopt if the polygon type is not Rectangular or Circular.
◆ IsEndSurfaceAttributeOverridden()
 bool ACAPI::Element::OpeningExtrusionParameters::IsEndSurfaceAttributeOverridden  |  ( |   | ) |   const
Returns
Returns whether the Surface attribute of the end surface of the extrusion body is overridden.
◆ IsExtrusionSurfaceAttributeOverridden()
 bool ACAPI::Element::OpeningExtrusionParameters::IsExtrusionSurfaceAttributeOverridden  |  ( |   | ) |   const
Returns
Returns whether the Surface attribute of the extrusion surface is overridden.